test/deepseek_v3.2-results-1220/converted_results/sglang_official_recommended_tp_dp_random_128k.txt
============ Serving Benchmark Result ============
Successful requests:                     50
Benchmark duration (s):                  389.54
Total input tokens:                      6400000
Total generated tokens:                  5000
Request throughput (req/s):              0.13
Output token throughput (tok/s):         12.84
Peak output token throughput (tok/s):    330.00
Peak concurrent requests:                50.00
Total Token throughput (tok/s):          16442.29
---------------Time to First Token----------------
Mean TTFT (ms):                          208784.94
Median TTFT (ms):                        228521.00
P99 TTFT (ms):                           386624.08
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          51.45
Median TPOT (ms):                        48.29
P99 TPOT (ms):                           74.02
---------------Inter-token Latency----------------
Mean ITL (ms):                           50.95
Median ITL (ms):                         24.63
P99 ITL (ms):                            430.95
==================================================