test/deepseek_v3.2-results-1220/converted_results/sglang_official_recommended_tp_dp_random_32k.txt
============ Serving Benchmark Result ============
Successful requests:                     100
Benchmark duration (s):                  160.32
Total input tokens:                      3200000
Total generated tokens:                  10000
Request throughput (req/s):              0.62
Output token throughput (tok/s):         62.38
Peak output token throughput (tok/s):    1240.00
Peak concurrent requests:                100.00
Total Token throughput (tok/s):          20022.76
---------------Time to First Token----------------
Mean TTFT (ms):                          83622.72
Median TTFT (ms):                        87712.84
P99 TTFT (ms):                           157285.48
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          245.69
Median TPOT (ms):                        239.81
P99 TPOT (ms):                           508.93
---------------Inter-token Latency----------------
Mean ITL (ms):                           244.68
Median ITL (ms):                         33.38
P99 ITL (ms):                            880.61
==================================================