test/deepseek_v3.2-results-1220/converted_results/vllm_tp_random_128.txt
============ Serving Benchmark Result ============
Successful requests:                     1000
Benchmark duration (s):                  12.52
Total input tokens:                      128000
Total generated tokens:                  4000
Request throughput (req/s):              79.84
Output token throughput (tok/s):         319.37
Peak output token throughput (tok/s):    1038.00
Peak concurrent requests:                1000.00
Total Token throughput (tok/s):          10539.36
---------------Time to First Token----------------
Mean TTFT (ms):                          5621.20
Median TTFT (ms):                        4538.46
P99 TTFT (ms):                           12357.11
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          747.47
Median TPOT (ms):                        669.25
P99 TPOT (ms):                           1514.56
---------------Inter-token Latency----------------
Mean ITL (ms):                           561.02
Median ITL (ms):                         647.20
P99 ITL (ms):                            3245.15
==================================================